app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `user`
SELECT COUNT(*) AS `numrows`
FROM `sungai`
SELECT COUNT(*) AS `numrows`
FROM `titik_pantau`
SELECT COUNT(index_kualitas_air.id_ika) AS nilai_ika, `index_kualitas_air`.`tahun_ika` AS `tahun_ika`, `index_kualitas_air`.`nilai_ika` AS `nilai_ika`
FROM `index_kualitas_air`
GROUP BY `index_kualitas_air`.`tahun_ika`, `index_kualitas_air`.`nilai_ika`
SELECT COUNT(index_kualitas_air.id_ika) AS jumlah_ika, `index_kualitas_air`.`tahun_ika` AS `tahun_ika`, `index_kualitas_air`.`jumlah_ika` AS `jumlah_ika`
FROM `index_kualitas_air`
GROUP BY `index_kualitas_air`.`tahun_ika`, `index_kualitas_air`.`jumlah_ika`
---
    public function index()
    {
        // user start
        $modelUser = new Users();
        $jumlah_karyawan = $modelUser->countAllResults();
        // user end

        // sungai start
        $modelSungai = new SungaiModel();
        $jumlah_sungai = $modelSungai->countAllResults();
        // sungai end

        // titik pantau start
        $modelTitikpantau = new TitikpantauModel();
        $jumlah_titikpantau = $modelTitikpantau->countAllResults();
        // titik pantau end

        // index pencemaran air start
        $modelIndexPencemaran = new IndexPencemaranModel();
        $jumlah_IndexPencemaran  =  $modelIndexPencemaran->countAllResults();
        // index pencemaran air end

        // index kualitas air start
        $modelIndexkualitasair = new IndexkualitasairModel();
        $nilaiIndexkualitasair = $modelIndexkualitasair->select('COUNT(index_kualitas_air.id_ika) AS nilai_ika, index_kualitas_air.tahun_ika AS tahun_ika ,index_kualitas_air.nilai_ika AS nilai_ika')
            ->groupBy('index_kualitas_air.tahun_ika')
            ->groupBy('index_kualitas_air.nilai_ika')
            ->get();
        // index kualitas air end

        // jumlah index kualitas air start
        $jumlahIKA =  $modelIndexkualitasair->select('COUNT(index_kualitas_air.id_ika) AS jumlah_ika, index_kualitas_air.tahun_ika AS tahun_ika ,index_kualitas_air.jumlah_ika AS jumlah_ika')
            ->groupBy('index_kualitas_air.tahun_ika')
            ->groupBy('index_kualitas_air.jumlah_ika')
            ->get();

SELECT COUNT(status_mutu_air.id_mutuair) AS jumlah, `status_mutu_air`.`katagori` AS `katagori`, `status_mutu_air`.`jumlah` AS `jumlah`, `status_mutu_air`.`kode_warna` AS `kode_warna`
FROM `status_mutu_air`
GROUP BY `status_mutu_air`.`kode_warna`, `status_mutu_air`.`katagori`, `status_mutu_air`.`jumlah`
---
        // JUMLAH MUTU air start
        $bulan = $this->request->getPost('bulan');
        $modelStatusmutuair = new StatusmutuairModel();
        $jumlahMUTU =  $modelStatusmutuair->select('COUNT(status_mutu_air.id_mutuair) AS jumlah, status_mutu_air.katagori AS katagori ,status_mutu_air.jumlah AS jumlah,status_mutu_air.kode_warna AS kode_warna')
            ->groupBy('status_mutu_air.kode_warna')
            ->groupBy('status_mutu_air.katagori')
            ->groupBy('status_mutu_air.jumlah')
            ->get();

SELECT COUNT(potensial.id_potensial) AS Nilai_domestik, `potensial`.`Tahun_domestik` AS `Tahun_domestik`, `potensial`.`Nilai_domestik` AS `Nilai_domestik`
FROM `potensial`
GROUP BY `potensial`.`Tahun_domestik`, `potensial`.`Nilai_domestik`
---

        // BOD POTENSIAL domestik
        $modelBODPotensial = new BODPotensialdomestik();
        $BodPOTENSIALdomestik =  $modelBODPotensial->select('COUNT(potensial.id_potensial) AS Nilai_domestik, potensial.Tahun_domestik AS Tahun_domestik  ,potensial.Nilai_domestik AS Nilai_domestik')
            ->groupBy('potensial.Tahun_domestik')
            ->groupBy('potensial.Nilai_domestik')
            ->get();

SELECT `Nilai_pij`
FROM `ipa`
WHERE `Titik_pantau` = 'Hulu'
AND SUBSTR(periode,1,7) = '2022-06'
---
    public function checkNilaiPij($titik_pantau, $bulan)
    {
        $db = \Config\Database::connect();
        $nilai_pij = $db->table('ipa')->select('Nilai_pij')->where('Titik_pantau', $titik_pantau)->where("SUBSTR(periode,1,7)", $bulan)->get()->getResult();

SELECT `Nilai_tssek`
FROM `eksisting`
WHERE `Titik_pantau` = 'Hulu'
AND SUBSTR(Periode,1,7) = '2022-06'
---
    public function checkNilaiTssek($titik_pantau, $bulan)
    {
        $db = \Config\Database::connect();
        $nilai_bodek = $db->table('eksisting')->select('Nilai_tssek')->where('Titik_pantau', $titik_pantau)->where("SUBSTR(Periode,1,7)", $bulan)->get()->getResult();